<template>
  <div class="app-container">
    <div class="app-top" :style="{height:type==3? '100%': 'initial',paddingBottom:type ===3? '0':'20px'}">
      <div class="header-top">
        <div @click="gotoHome()"><img src="../../icons/images/logo.png" alt=""></div>
      </div>
      <div ref="myAppContainer" class="contentList">
        <div v-show="type==1" class="oneContent">
          <div class="title">热抖数据用户注册协议</div>
          <div class="contentInfo">
            <span class="importantInfo">重要须知：</span><br>
            <span class="importantInfo">
              热抖数据网站（网址：https://www.hotdogdata.cn）及微信小程序（以下简称“平台”）是由热狗云（杭州）科技有限公司（以下简称“本公司”）所有并运营管理的大数据产品服务平台。<br>
            </span>
            本公司在此特别提醒您仔细阅读本《热抖数据用户注册协议》（下称“本协议”）中的各个条款，包括但不限于免除或者限制会员责任的条款、对用户权利进行限制的条款以及约定争议解决方式、司法管辖的条款。您有权选择同意或者不同意本协议。<br>
            <span class="importantInfo">
              您与本公司均应当严格履行本协议及平台规则所约定的各项义务，如发生争议或者纠纷，双方可以友好协商解决；协商不成的，任何一方均可提请本协议签订地浙江省杭州市滨江区人民法院以诉讼方式解决。<br>
            </span>
            <span class="importantInfo">
              您如果通过登录热抖数据网站用户注册页面或者微信小程序用户注册账号，即视为您完全同意本协议，愿意接受本协议所有及任何条款的约束。
            </span>
            <br>
            您使用本平台提供的服务时，应同时接受适用于本平台适时公布的各项规则、条款和政策（以下统称为“其他条款”）；如果以下使用条件与“其他条款”有不一致之处，则以后发布的规则或条款为准。
            <br>
            您确认，如果您在18周岁以下，您只能在父母或其他监护人的监护参与下才能使用本站。
            <br>
            <span class="importantInfo">
              第一条 释义
            </span>
            <br>
            除您与本公司另有约定外，本协议及其其他规则当中的下列名词均采用如下解释：<br>
            <span class="importantInfo">1、热抖数据用户协议：即本协议，指您与本公司在注册时订立的旨在约定您登录、使用本平台大数据产品的过程中，您与本公司之间的权利、义务的合同。<br>
              <span class="importantInfo">2、热抖数据：即本平台，指本公司运营和管理的，为平台注册用户和会员提供大数据产品服务平台。<br>
                <span class="importantInfo">3、大数据产品：是指本公司基于“SmartDog”1.0版本智能数据算法开发的第三方内容电商分析数据，具体包括本平台展示的“直播榜”“主播榜”“商品榜”“小店榜”及本公司未来开发的数据产品等。<br>
                  <span class="importantInfo">4、注册用户：是指熟悉本平台的服务内容，具有相应的服务需求，且接受本协议与平台各项规则的个体。<br>
                    <span class="importantInfo">5、会员：</span>即本平台注册后在平台购买专业版用户享受专业服务的用户，当前本平台的会员包括免费会员及付费会员，具体包括标准版会员、专业版月卡会员、专业版季卡会员、专业版年卡会员和企业版年卡、终身会员。<br>
                    <span class="importantInfo">第二条 用户注册</span><br>
                    1、您通过本平台的用户注册页面，注册账号并设置相应的登录密码，一经注册成功，您即成为本平台标准版会员用户，可以凭借用户账号及登录密码登录及使用本平台的部分服务。<br>
                    2、您同意根据本平台的要求，填写各项个人信息，并保证提供的注册资料真实、准确、完整、合法有效，您的注册资料如有变动的，应及时更新其注册资料。<br>
                    3、如果您提供的注册资料不合法、不真实、不准确、不详尽的，您需承担因此引起的相应责任及后果，本公司保留单方终止您使用本平台各项服务的权利。<br>
                    4、若您冒用、盗用或以其他未经授权方式使用他人资料进行注册登记的，由此引起的一切后果概由您独立承担。本公司获悉或怀疑您未经授权使用他人资料注册的,可以采取立即注销您的账户、暂停或者终止为您提供服务等措施而无须承担任何责任。<br>
                    <span class="importantInfo">第三条 会员卡购买</span><br>
                    1、若您想进一步使用本平台的产品，您需要购买平台展示的会员卡，成为本平台的专业会员。<br>
                    2、本平台的专业会员根据使用时间划分为月卡、季卡、年卡及企业版的年卡和终身会员卡，不同的会员获得的本平台的服务时间不同，且服务内容也可能存在区别。<br>
                    3、需要购买会员卡才能获得更深度的平台服务的产品包括：“直播榜”“主播榜”“商品榜”“小店榜”等。<br>
                    4、您通过本平台付费购买会员卡后，务必妥善保管您的用户账号、登录密码，且不得将其赠与、转让、借用或者以其他的方式提供给第三方。否则，由此给本公司（或任何第三方）造成的一切损失，概由您自行承担（或者负责赔偿）。<br>
                    5、您同意，本公司将根据数据产品的更新及开发情况，不定期调整专业版会员的服务价格，但不影响已购用户的服务。<br>
                    <span class="importantInfo">
                      6、您充分理解并完全同意：本公司如果发现您此前通过本平台的内容或数据信息大多数并非用于个人使用或违反平台《会员管理规则》的，本公司有权终止您的会员资格；<br>
                    </span>
                    <span class="importantInfo">第四条 用户权限</span><br>
                    1、根据本公司目前的用户分类标准，用户注册完成后，根据用户的付费情况将用户分为标准版用户、专业版会员用户和私有部署会员用户。<br>
                    2、您知悉，根据不同的用户具有不同的服务权限，具体分类见网站会员权益。<br>
                    3、您知悉并同意，本公司根据技术的不断更新迭代升级，将对平台数据产品进行升级调整，届时将根据调整的结果通过平台进行是公示。<br>
                    <span class="importantInfo">第五条 用户限制</span><br>
                    本平台通过互联网向不特定主体展示网站信息，您作为本平台的注册用户，对平台各项服务使用必须遵守本平台规则及法律、国家法律和国际法律。您在使用本平台提供的服务时，必须接受以下使用限制：<br>
                    1、使用平台产品或利用平台的服务时必须符合当地有关法规，不得在平台的网页上或者利用平台的服务制作、复制、发布、传播的任何信息，不得(a) 违反宪法确定的基本原则；(b) 危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统一的；(c) 损害国家荣誉和利益的；(d) 煽动民族仇恨、民族歧视，破坏民族团结的；(e) 破坏国家宗教政策，宣扬邪教和封建迷信的；(f) 散布谣言，扰乱社会秩序，破坏社会稳定的；(g) 散布淫秽、色情、赌博、暴力、恐怖或者教唆犯罪的；(h) 侮辱或者诽谤他人，侵害他人合法权益的；(i) 煽动非法集会、结社、游行、示威、聚众扰乱社会秩序的；(j) 以非法民间组织名义活动的；(k)破坏党政军工作人员的良好形象；（l） 含有法律、行政法规禁止的其他内容的。<br>
                    2、用户应妥善经营，如您出现下列情况，本公司将判断您的行为异常，对您的账号进行关注或冻结使用：(a) 超过会员权限，把账号借用给第三方或与第三方共享账号；(b) 访问的IP地址来源于云服务商，机房网络等；(c) 单独一个账号在一段时间范围内在多个城市切换使用；（d）技术模拟点击访问本平台;(e)其他侵犯本公司及他人合法权益的行为。<br>
                    3、用户不得违反知识产权保护义务，滥用平台产品内容、数据，包括但不限于删减、混剪的方式编辑他人著作权作品、侵害他人知识产权或者合法利益的其他行为。<br>
                    <span class="importantInfo">第六条 免责声明</span><br>
                    <span class="importantInfo">1、关于本平台的免责声明</span><br>
                    （1）本平台与其他的在线使用的互联网网站一样，也会受到各种不良信息、网络安全和网络故障问题的困扰，包括但不限于：<br>
                    ①其他用户可能会发布诈骗或虚假信息，或者发表有谩骂、诅咒、诋毁、攻击内容的，或者含有淫秽、色情、下流、反动、煽动民族仇恨等让人反感、厌恶的内容的非法言论；<br>
                    ②其他用户可能会利用本平台数据、资料侵犯您及第三方知识产权、肖像权、姓名权、名誉权、隐私权和/或其他合法权益的图片、照片、文字等资料；<br>
                    ③面临着诸如黑客攻击、计算机病毒困扰、系统崩溃、网络掉线、网速缓慢、程序漏洞等问题的困扰和威胁。<br>
                    <span class="importantInfo">
                      （2）您充分理解到：本条第1款所述的各种不良信息、网络安全和网络故障问题，并不是本公司或者本平台所导致的问题，由此可能给您造成的损失，概由您自行承担，本公司无须向您承担任何责任。
                    </span><br>
                    （3）您完全同意：除法律法规规定或者您与本公司约定须提前通知的以外，平台有权单方面地中止或者终止本平台所提供的服务而无须提前通知您。该等中止、终止，可能是因为本公司解散、注销、合并、分立，也可能是因为本公司将本平台或其运营权转让给了第三方，还可能是因为国家法律、法规、政策及国家机关的命令或者其他的诸如地震、火灾、海啸、台风、罢工、战争等不可抗力事件，还可能是因为您违反本协议所约定的用户守则。<br>
                    <span class="importantInfo">2、关于平台数据产品的免责声明<br>
                      （1）由于本平台提供的数据产品属于对某类单品、达人或店铺信息的趋势分析，且该分析结果是依据往期信息的基础上作出的数据模型验算结果，仅能作为对未来的预测，可能会偏离未来实际情况，因此，若您按照平台产品作出的决策，本公司不需承担任何承诺或担保责任。<br>
                      （2）本平台数据产品还会受到第三方数据源不稳定、格式变化及其他不可控因素的影响，在此前提下，平台数据产品的分析结果，可能会出现信息错误或不准确的情况，您同意对本公司予以免责。<br>
                      （3）由于合理的或不可避免的信息延迟对您或第三方带来的任何损失，本公司不负任何责任。在这种情况下，本公司将尽快地把任何可预知的延迟情况通知您。
                    </span><br>
                    <span class="importantInfo">
                      第七条 本协议及平台规则、政策的生效、变更<br>
                      1、本公司将本协议内置于本平台的注册环节，您接受本协议通过网络界面以电子文本的方式签订。<br>
                      2、您在注册的过程中即可查阅、了解本协议，并通过勾选“我已阅读并接受【服务条款】”，表示您完全同意并接受本协议之约束，本协议即开始生效。<br>
                      3、您知悉，本平台除本协议之外，还通过网站页面展示的方式向用户公示了平台政策或规则，您同意前述政策或规则均为本协议的构成或补充，与本协议有同等法律效力。该等政策或规则通过本平台公示后，您依然通过本平台进行交易、接受本平台服务的，即视为您已接受该等政策或规则，并接受该等政策或规则的约束。<br>
                      4、您知悉本公司有权随时修改本协议及相关规则。您在登录或浏览本平台时应该首先浏览本平台的相关公告，以了解本协议及相关政策、规则的变化。如果在本协议或政策规则后，仍继续使用本平台提供的服务，即表示您同意本平台对本协议及相关政策、规则所做的所有修改，并愿意承担相应的法律后果。<br>
                      第八条 不可抗力<br>
                      您同意，您与本公司均对不可抗力导致的损失不承担责任。<br>
                      本条款所指不可抗力包括：天灾、法律法规或政府指令的变更，因网络服务特性而特有的原因，例如境内外基础电信运营商的故障、计算机或互联网相关技术缺陷、互联网覆盖范围限制、计算机病毒、黑客攻击、重大疫情等因素，及其他合法范围内的不能预见、不能避免并不能克服的客观情况。<br>
                    </span>
                    <span class="importantInfo">第九条 其他</span><br>
                    1、本协议各条款是可分的，所约定的任何条款如果部分或者全部无效，不影响该条款其他部分及本协议其他条款的法律效力。<br>
                    2、本协议各条款的标题只是为了方便用户阅读而起到提示、醒目的作用，对本协议的解释及适用没有任何指引作用。<br>
                    3、本协议及其补充协议签订地为浙江省杭州市，均受中华人民共和国法律、法规管辖。<br>
                    <span class="importantInfo">
                      您已经阅读、理解并接受本协议的全部条款及各类规则，并承诺遵守中国现的法律、法规、规章及其他政府规定，如有违反而导致任何法律后果的发生，您将以自己的名义独立承担所有相应的法律责任。<br>
                    </span>
                  </span></span></span></span></div>
        </div>
        <div v-show="type==2" class="oneContent">
          <div class="title">热抖数据个人信息及隐私保护政策</div>
          <div class="contentInfo">
            <span class="importantInfo">
              重要须知：<br>
              热狗云（杭州）科技有限公司（下称“本公司”）一贯重视用户的个人信息及隐私的保护，在您使用热抖数据的服务时，平台有可能会收集和使用您的个人信息。为此，本公司特制定《热抖数据个人信息及隐私保护政策》（以下简称“本隐私政策”）予以说明。
              本隐私政策与您使用平台的服务息息相关，请您务必仔细阅读、充分理解（未成年人应当在其监护人的陪同下阅读）。<br>
            </span>
            第一条 个人信息的收集 <br>
            本公司为提高热抖数据的售前、售后服务质量及更个性化的服务，并努力提高您的用户体验，根据“最少收集原则”可能收集信息的种类如下：<br>
            1、注册信息 <br>
            具体包括您通过热抖数据网站或小程序，填写电话/手机号码、微信名称、微信ID信息。<br>
            2、在线交易信息 <br>
            （1）设备信息。在您访问热抖数据网站或通过小程序进行交易购买专业会员时，系统自动接收并记录的您的浏览器和计算机设备上的信息，包括但不限于您的IP地址、浏览器的类型、访问日期和时间、软硬件特征信息及您需求的网页记录等数据。<br>
            （2）您的位置信息。当您下载或使用热抖数据网站、小程序时，还可能会读取您的位置及所处的场景信息，以用来确认用户的需求真实性。<br>
            （3）您的行为和交易信息。还将可能会记录您的充值账户，并通过您预留的手机号码进行短信验证正在进行交易的相关信息（如，订单支付详情）；为帮助我们提供服务（包括特定服务）而提供给我们的信息。<br>
            3、鉴于您个人信息是本公司提供服务的必要信息，您同意并接受本公司暂无法提供撤回信息收集授权的渠道和权限。<br>
            第二条 信息的合理使用 <br>
            您充分理解并完全接受，为向您提供服务、提升我们的服务质量以及优化您的服务体验，我们会在符合法律规定下使用您的个人信息，并主要用于下列用途：<br>
            （1）在您登录热抖数据网站或者小程序时，用于验证您的身份、售后服务以及其他客户服务；<br>
            （2）帮助本公司分析、了解用户需求，开发新的数据产品，或将其用于本公司所开展的新业务当中；<br>
            （3）向您推荐您可能感兴趣的产品或服务信息。如您不希望接收上述信息，可通过相应的退订功能进行退订；<br>
            （4）热抖数据网站或者小程序、智能算法版本的升级、改版；<br>
            （5）可能使用您的个人信息用于预防和追究各种违法、犯罪活动或违反我们政策规则的行为，以保护您、其他平台用户的合法权益；<br>
            （6）我们会对我们的服务使用情况进行统计，并可能会与公众或第三方分享这些统计信息，以展示我们的产品或服务的整体使用趋势。<br>
            （7）其他的用于改进热抖数据的服务、提升用户体验的目的。<br>
            第三条 个人信息的存储<br>
            1、您同意，本公司对您个人信息进行收集后，将通过公司专用服务器进行单独存储，存储的时间目前暂定为五年，若有变更的，本公司将对变更后的时间通过热抖数据进行公示。<br>
            2、超出本公司公布的个人信息保存期限后，本公司将对您的个人信息进行删除或匿名化处理。<br>
            第四条 个人信息访问、更正、访问和删除<br>
            1、鉴于本公司提供服务过程中收集信息的种类和内容，您同意暂时无需向您提供信息访问的渠道。<br>
            2、您更换手机号码，或发现个人微信名称错误时或不完整的，本公司将为您提供请求更正或补充信息的方法或沟通渠道。<br>
            3、如果您发现，存在以下情形的，你可以提出要求删除您的个人信息，本公司将及时删除个人信息：<br>
            1) 本公司违反法律法规规定，收集、使用个人信息的；<br>
            2) 本公司违反了与个人信息主体的约定，收集、使用个人信息的。<br>
            3) 本公司违反法律法规规定或违反与个人信息主体的约定向第三方共享、转让个人信息，且您要求删除的，本公司将立即停止共享、转让的行为，并通知第三方及时删除；<br>
            4) 本公司违反法律法规规定或与您的约定，公开披露个人信息，且您要求删除的，本公司将立即停止公开披露的行为，并发布通知要求相关接收方删除相应的信息。<br>
            第五条 个人账户注销<br>
            1、您同意，随着本公司运营的逐步完善，将向您提供个人账户注销的窗口。<br>
            2、在您申请注销个人账户后，本公司将删除您的个人信息或做匿名化处理。<br>
            第六条 个人信息的保护与例外<br>
            您充分理解并完全接受，根据个人信息保护规范及相关法律、法规的规定，以下情形中，本公司收集、使用您的个人信息无需征得您的授权同意：<br>
            a) 与国家安全、国防安全直接相关的；<br>
            b) 与公共安全、公共卫生、重大公共利益直接相关的；<br>
            c) 与犯罪侦查、起诉、审判和判决执行等直接相关的；<br>
            d) 出于维护个人信息主体或其他个人的生命、财产等重大合法权益但又很难得到本人同意的；<br>
            e) 所收集的个人信息是个人信息主体自行向社会公众公开的；<br>
            f) 从合法公开披露的信息中收集个人信息的，如合法的新闻报道、政府信息公开等渠道；<br>
            g) 根据个人信息主体要求签订和履行合同所必需的；<br>
            h) 用于维护所提供的产品或服务的安全稳定运行所必需的，例如发现、处置产品或服务的故障；<br>
            i) 个人信息控制者为新闻单位且其在开展合法的新闻报道所必需的；<br>
            j) 个人信息控制者为学术研究机构，出于公共利益开展统计或学术研究所必要，且其对外提供学术研究或描述的结果时，对结果中所包含的个人信息进行去标识化处理的；<br>
            k) 法律法规规定的其他情形。<br>
            第七条 责任的免除<br>
            您充分理解并完全接受，尽管本公司采取各种安全技术和程序存储、保护用户信息，防止其被未经授权的访问、使用、复制和泄露，但用户信息仍然有可能发生被黑客攻击、窃取，因不可抗力或者其他非本公司的自身原因而被泄露的情形。对此，您同意，在本公司采取了必要的措施防止上述情形之发生，并在上述情形发生之后及时通知用户信息泄露的情况，并采取必要的措施防止其损失进一步扩大，本公司则无须赔偿由此给您造成的任何损失。<br>
            第八条 未成年人信息保护<br>
            本公司重视对未成年人个人信息的保护。我们不希望未成年人直接使用热抖数据网站提供的产品或服务，如果您是未成年人，请与您监护人一起或在监护人的监督下使用本网站的产品或服务。<br>
            第九条 一致性<br>
            本隐私政策是《热抖数据用户注册协议》不可分割的组成部分，与之具有同等的法律效力；本隐私政策与《热抖数据用户注册协议》不一致或者矛盾的地方，适用本《隐私政策》；未涉及的内容，仍适用《热抖数据用户注册协议》。<br>
            第十条 可分性<br>
            本隐私政策条款是可分的，所约定的任何条款如果部分或者全部无效，不影响该条款其他部分及本协议其他条款的法律效力。<br>
            第十一条 通知和修订<br>
            您同意，随着个信息保护政策相关法律、法规及政策的不断变化，本公司可能通过热抖数据网站或小程序另行说明或对本隐私政策进行修订，若存在相矛盾或者不一致的，以另行说明或修订后的政策为准。<br>
            如果您对于本隐私政策或在使用热抖数据服务时对于您的个人信息或隐私情况有任何问题，请联系本公司客服并作充分描述，本公司将竭尽全力解决。<br>
            <span class="importantInfo">
              如果您在注册时“勾选”本协议，并使用或者继续使用平台服务，即视为您充分理解并完全接受本隐私政策；您如果对本隐私政策有任何疑问、异议或者不能完全接受本隐私政策，请通过平台指定联系方式联系本公司。<br>
            </span>
          </div>
        </div>
        <div v-show="type==3" class="oneContent">
          <div class="title">热抖数据知识产权保护声明</div>
          <div class="contentInfo">
            <span class="importantInfo">
              <div style="text-indent:2em;">
                热抖数据网站（网址：https://www.hotdogdata.cn）及微信小程序（以下简称“平台”）是由热狗云（杭州）科技有限公司（以下简称“本公司”）所有并运营管理的大数据产品服务平台。<br>
              </div>
              <div style="text-indent:2em;">
                作为大数据产品开发为主营业务的新型科技公司，本公司尤为重视知识产权的保护，现本公司就知识产权的保护声明如下：<br>
              </div>
            </span>
            <div style="text-indent:2em;">
              1、平台产品涉及的知识产权<br>
            </div>
            <div style="text-indent:2em;">
              本公司热抖数据的产品包括：“直播榜”“主播榜”“商品榜”“小店榜”。该等产品所展示的图片、视频等内容的归原著作权人/制作人所有，仅供平台注册用户进行学习用途。未经本公司的书面同意或原著作权人或制作人的同意，您不得对该等作品进行删减、混剪、编辑等侵权行为。<br>
            </div>
            <div style="text-indent:2em;">
              热抖数据“视频素材”所展示的内容均归第三方主体所有。本公司通过平台展示仅供平台注册用户提供学习的机会，不是本公司开发的大数据产品，因此也并非本公司予以出售的对象。<br>
            </div>
            <div style="text-indent:2em;">
              如果您通过热抖数据获得了他人的作品且可能侵犯了该作品的版权，或者任何第三方主张您侵犯了其知识产权，请予以及时通知本公司，并请提供侵权作品的材料对应的产品信息及知识产权所有权人的联系方式等信息。<br>
            </div>
            <div style="text-indent:2em;">
              2、除上述内容外，本公司拥有热抖数据的内容享有全部知识产权，包括但不限于：智能算法、编码、商标、照片、平台文案、计算机软件、标识等，均受到中华人民共和国知识产权相关法律法规的保护。您对其仅享有本协议约定范围内的临时的、可撤销的非专有使用权。<br>
            </div>
            <div style="text-indent:2em;">
              3、您仅在符合本平台使用目的的前提下被许可浏览和使用本平台，即以个人名义浏览信息和购买供个人使用商品的目的。其他方式的使用都是被严格禁止的，包括但不限于以下方式：复制、修改、销售、传送、再版、删除、添加、展览、记录或演示本平台的内容或以其他方式部分地或整体地非法使用本平台的内容，但经本公司允许将本平台当中的资讯转发至微信朋友圈等第三方媒体的除外。<br>
            </div>
            <span class="importantInfo">
              <div style="text-indent:2em;">
                本声明通过热抖数据网站及小程序进行公示，公示期为15天，若公示期满您继续使用平台服务的，即视为您接受本声明的所有内容，本声明将作为本公司纠纷解决的重要参考依据。<br>
              </div>
            </span>
            <div style="display: flex;flex-direction: row;justify-content: flex-end;"> 日期：2021年2月8日</div>
          </div>
        </div>
        <div v-show="type==4" class="oneContent">
          <div class="title">热抖数据会员管理规则</div>
          <div class="contentInfo">
            <div style="text-indent:2em;">
              第一章 总 则<br>
            </div>
            <div style="text-indent:2em;">
              第一条 为加强对会员的自律管理，保障会员的合法权益，规范会员在热抖数据（以下简称“平台”）的业务活动，根据中华人民共和国有关法律、法规及《热抖数据用户注册协议》制定本办法。
            </div>
            <div style="text-indent:2em;">
              第二条 会员是指自愿接受《热抖数据用户注册协议》、平台各项规则（含本规则）的约束，经热抖数据审核批准注册，享有平台提供的各项权益的个体（包括自然人、法人机构或其他组织）。
            </div>
            <div style="text-indent:2em;">
              第三条 热抖数据会员按照权利义务的不同，可以分免费会员及付费会员，其中，免费会员专指标准版会员。
            </div>
            <div style="text-indent:2em;">
              第四条 标准版会员即通过平台注册申请并审核通过后即可获得标准版会员资格。
            </div>
            <div style="text-indent:2em;">
              第五条 付费会员按照服务时间的不同，可以分为专业版月卡会员、专业版季卡会员、专业版年卡会员和企业版年卡、终身会员。<br>
            </div>
            <div style="text-indent:2em;">
              第六条 会员使用热抖数据提供的各项服务，应当遵守法律、行政法规、规章的规定和平台用户注册协议、各项规则的约束，诚实守信，规范使用各项数据。<br>
            </div>
            <div style="text-indent:2em;">
              第七条 本办法适用于热抖数据所有会员。
            </div>
            <div style="text-indent:2em;">
              第二章 会员申请与程序<br>
            </div>
            <div style="text-indent:2em;">
              第八条 申请成为热抖数据的会员，在满足《热抖数据用户注册协议》对会员条件的规定的同时，还必须具备下列条件:<br>
            </div>
            <div style="text-indent:2em;">
              (一)具有中华人民共和国国籍或中华人民共和国境内登记或注册设立法人及其他组织; (二)承认并承诺遵守热抖数据用户注册协议及各项规则的约束; (三)依法合规经营、信誉良好，近期无严重违法违规行为; (四)承诺认缴热抖数据的会员资格费用; (五)热抖数据规定的其他条件。<br>
            </div>
            <div style="text-indent:2em;">
              第九条 法人或其他组织申请热抖数据会员资格，除向热抖数据支付相应的会员费用外。 平台根据对会员的审核可能还需要会员提供以下资料:<br>
            </div>
            <div style="text-indent:2em;">
              (一)申请热抖数据会员资格的用途; (二)书面承诺遵守热抖数据各项规则; (三)营业执照副本复印件或照片; (四)热抖数据要求说明的其他情况。<br>
            </div>
            <div style="text-indent:2em;">
              第十条 标准版会员入会按照热抖数据注册协议规定办理，专业版月卡会员、专业版季卡会员付费完成后经经理批准，专业版年卡会员和企业版年卡、终身会员由经理审议后提执行董事批准。
            </div>
            <div style="text-indent:2em;">
              第十一条 热抖数据收到会员的付费后，应于1个工作日内对会员资格进行审核，作出是否同意入会申请的办理意见。如不同意入会申请，应于当日返还会员支付的相应费用并释明拒绝理由。
            </div>
            <div style="text-indent:2em;">
              第十二条 申请成为付费会员的注册用户应及时完成以下事项：
            </div>
            <div style="text-indent:2em;">
              (一)交纳会员费用：专业版月卡500元;专业版季卡1500元；专业版年卡6000元；企业版年卡30000元；终身会员卡8888元。若平台有优惠活动的，以具体的优惠价格为准。 (二)根据平台的通知提供相应的会员资料; (三)其他应当办理的事项。
            </div>
            <div style="text-indent:2em;">
              费用支付申请发起后逾期未支付或未按照平台要求提供相关资料的，视为自动放弃会员资格及权益。
            </div>
            <div style="text-indent:2em;">
              第十三条 会员享有热抖数据服务的权利，并应履行热抖数据规定的会员义务。
            </div>
            <div style="text-indent:2em;">
              第三章 会员资格的变更与终止<br>
            </div>
            <div style="text-indent:2em;">
              第十四条 会员资格取得后，会员资格暂不提供转让、承继权限。同时，未经平台同意并备案，会员不得将账户转让、出租、出借给任何第三方使用。<br>
            </div>
            <div style="text-indent:2em;">
              第十五条 若会员有特殊情况需要终止的，可通过平台指定的联系方式与热抖数据进行联系。<br>
            </div>
            <div style="text-indent:2em;">
              第十七条 会员存在以下情形之一的，经批准，可以取消其会员资格:<br>
            </div>
            <div style="text-indent:2em;">
              (一)被监管机构勒令停业整顿的;<br>
            </div>
            <div style="text-indent:2em;">
              (二)私下转让会员资格，将账户交给他人使用的;<br>
            </div>
            <div style="text-indent:2em;">
              (三)拒不执行会员管理规则的;<br>
            </div>
            <div style="text-indent:2em;">
              (四)参与非法交易活动的;
            </div>
            <div style="text-indent:2em;">
              (五)未按规定缴纳会员费用的;
            </div>
            <div style="text-indent:2em;">
              (六)其他违反中华人民共和国法律、法规、规章和严重违反交易所章程及有关规定的。
            </div>
            <div style="text-indent:2em;">
              被取消会员资格的，热抖数据可自行将其除名并作出相应安排。
            </div>
            <div style="text-indent:2em;">
              第十八条 会员存在下列情形之一的，应在10个工作日内向热抖数据报告:(一)因知识产权侵权产生重大诉讼案件或侵权纠纷、投诉的; (二)因涉嫌违法、违规受到监管机关立案调查、处罚或者受到所在商城的处罚; (三)热抖数据要求报告的其他情况。
            </div>
            <div style="text-indent:2em;">
              第十九条 会员应对平台非公开信息资料保密，不得泄露通过会员资格才能获取的平台产品信息，法律、行政法规、部门规章另有规定的除外。
            </div>
            <div style="text-indent:2em;">
              第二十条 会员不得以各种形式利用本平台进行虚假宣传，未经本平台的允许不得使用“热抖数据”字样。
            </div>
            <div style="text-indent:2em;">
              第五章 监督管理<br>
            </div>
            <div style="text-indent:2em;">
              第二十一条 会员及其相关从业人员应当遵守中华人民共和国 有关法律、法规、政策和热抖数据注册协议、规则等各项规定。
            </div>
            <div style="text-indent:2em;">
              第二十二条 未获得及时有效的服务，经本平台同意，会员可以指定业务联络人员，与本平台进行对接。
            </div>
            <div style="text-indent:2em;">
              第二十三条 会员有下列情况之一的，热抖数据有权要求会员限期整改: (一)出现重大侵权投诉; （二）除热抖数据授权同意外，会员擅自使用热抖数据的标识及文字用于经营活动。(三)业务活动违反热抖数据相关规定的; (四)热抖数据认为的其他情况。会员未能在限期内整改的，热抖数据有权暂停会员权益直至取消其会员资格。
            </div>
            <div style="text-indent:2em;">
              第二十四条 会员应维护热抖数据的声誉，协助热抖数据处理各种突发或异常事件。
            </div>
            <div style="text-indent:2em;">
              第二十五条 会员不当使用会员资格发生转让、出借、出租等情况被取消会员资格或到期终止及协商一致提前终止情形的，该会员权益自动失效。
            </div>
            <div style="text-indent:2em;">
              第二十六条 热抖数据可以依据特别会员具体类型制定实施细则等管理制度对其进行日常管理。
            </div>
            <div style="text-indent:2em;">
              第六章 附 则<br>
            </div>
            <div style="text-indent:2em;">
              第二十七条 本办法由热狗云（杭州）科技有限公司制定和解释，各版本之间规则产生歧义的，以最近公布的文本为准。
            </div>
            <div style="text-indent:2em;">
              第二十八条 本规则自平台发布之日起进行公示，公示期为十五日，公示期满实施。
            </div>
            <div style="display: flex;flex-direction: row;justify-content: flex-end;"> 日期：2021年2月8日</div>
          </div>
        </div>
      </div>
      <copyView ref="copy" />
    </div>
  </div>
</template>
<script>
import copyView from '@/components/copy/copyVue.vue'
export default {
  name: 'UserNeedKnow',
  components: {
    copyView
  },
  data() {
    return {
      type: undefined
    }
  },
  mounted() {
    this.type = this.$route.query.type
    this.initData()
    this.$refs.copy.resetCss(this.$refs.myAppContainer)
  },
  methods: {
    async logout() {
      await this.$store.dispatch('user/logout')
      this.$router.push(`/login?redirect=${this.$route.fullPath}`)
    },
    initData() {
      document.documentElement.style.fontSize = document.documentElement.clientWidth / 14.4 + 'px'
    },
    gotoHome() {
      this.$router.push({ path: '/' })
    }
  }
}
</script>

<style lang="scss" scoped="scoped">
  .app-container{
    padding: 0;
    height: 100%;
  }
  .app-top{
    background:rgba(240,242,245,1);
    padding-bottom: 20px;
  }
  .header-top{
    width: 100%;
    height: 64px;
    background: #FFFFFF;
    box-shadow:0px 1px 4px 0px rgba(0,21,41,0.12);
    display: flex;
    justify-content: space-between;
    align-items: center;
    padding: 0 34px;
    position: relative;
  }
  .header-top>div:first-child>img{
    height: 44px;
    width: 171px;
    position: absolute;
    top:50%;
    transform: translateY(-50%);
    cursor: pointer;
  }
  .contentList{
    width: 8.32rem;
    margin: auto;
    background: #FFFFFF;
    padding: 0.46rem 0.39rem;
    margin-top: 64px;
  }
  .oneContent> .title{
    line-height: 33px;
    font-size:24px;
    font-family:PingFangSC-Regular,PingFang SC;
    font-weight:400;
    color:#373737;
    text-align: center;
    margin-bottom: 0.33rem;
  }
  .importantInfo{
    font-weight:600;
    color:rgba(103,103,102,1);
  }
  .contentInfo{
    font-size:14px;
    font-weight:400;
    line-height: 20px;
    color:#424448;
  }
  @media screen and (min-width:350px) and (max-width:1000px){
    .contentList{
      width: 90%;
      margin-top: 0;
    }
    .header-top{
      padding: 0 !important;
      height: initial !important;
      background: #f0f2f5 !important;
      opacity: 0;
    }
    .header-top>div:first-child>img{
      display: none;
    }
    .app-top{
      padding-bottom: 21px;
      padding-top: 23px;
    }
    .title{
      padding-top: 23px;
      margin-bottom: 28px !important;
    }
  }
</style>
